nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/can/processor/can_p32mx575f256l.h
PLIB_INLINE_API void PLIB_CAN_ChannelReset(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     CAN_ChannelReset_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ChannelResetIsComplete(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     return CAN_ChannelResetIsComplete_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsChannelReset(CAN_MODULE_ID index)
{
     return CAN_ExistsChannelReset_pic32(index);
}

PLIB_INLINE_API void PLIB_CAN_ChannelUpdate(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     CAN_ChannelUpdate_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsChannelUpdate(CAN_MODULE_ID index)
{
     return CAN_ExistsChannelUpdate_pic32(index);
}

PLIB_INLINE_API void PLIB_CAN_ModuleEventEnable(CAN_MODULE_ID index, CAN_MODULE_EVENT flags)
{
     CAN_ModuleEventEnable_Default(index, flags);
}

PLIB_INLINE_API void PLIB_CAN_ModuleEventDisable(CAN_MODULE_ID index, CAN_MODULE_EVENT flags)
{
     CAN_ModuleEventDisable_Default(index, flags);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsModuleEventEnable(CAN_MODULE_ID index)
{
     return CAN_ExistsModuleEventEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_ModuleEventClear(CAN_MODULE_ID index, CAN_MODULE_EVENT flags)
{
     CAN_ModuleEventClear_Default(index, flags);
}

PLIB_INLINE_API CAN_MODULE_EVENT PLIB_CAN_ModuleEventGet(CAN_MODULE_ID index)
{
     return CAN_ModuleEventGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsModuleEventClear(CAN_MODULE_ID index)
{
     return CAN_ExistsModuleEventClear_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_ChannelEventEnable(CAN_MODULE_ID index, CAN_CHANNEL channel, CAN_CHANNEL_EVENT flags)
{
     CAN_ChannelEventEnable_pic32(index, channel, flags);
}

PLIB_INLINE_API void PLIB_CAN_ChannelEventDisable(CAN_MODULE_ID index, CAN_CHANNEL channel, CAN_CHANNEL_EVENT flags)
{
     CAN_ChannelEventDisable_pic32(index, channel, flags);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsChannelEventEnable(CAN_MODULE_ID index)
{
     return CAN_ExistsChannelEventEnable_pic32(index);
}

PLIB_INLINE_API CAN_EVENT_CODE PLIB_CAN_PendingEventsGet(CAN_MODULE_ID index)
{
     return CAN_PendingEventsGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPendingEventsGet(CAN_MODULE_ID index)
{
     return CAN_ExistsPendingEventsGet_Default(index);
}

PLIB_INLINE_API CAN_CHANNEL_MASK PLIB_CAN_AllChannelEventsGet(CAN_MODULE_ID index)
{
     return CAN_AllChannelEventsGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsAllChannelEvents(CAN_MODULE_ID index)
{
     return CAN_ExistsAllChannelEvents_Default(index);
}

PLIB_INLINE_API CAN_CHANNEL_MASK PLIB_CAN_AllChannelOverflowStatusGet(CAN_MODULE_ID index)
{
     return CAN_AllChannelOverflowStatusGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsAllChannelOverflow(CAN_MODULE_ID index)
{
     return CAN_ExistsAllChannelOverflow_Default(index);
}

PLIB_INLINE_API CAN_CHANNEL_EVENT PLIB_CAN_ChannelEventGet(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     return CAN_ChannelEventGet_Default(index, channel);
}

PLIB_INLINE_API void PLIB_CAN_ChannelEventClear(CAN_MODULE_ID index, CAN_CHANNEL channel, CAN_CHANNEL_EVENT events)
{
     CAN_ChannelEventClear_Default(index, channel, events);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsChannelEvent(CAN_MODULE_ID index)
{
     return CAN_ExistsChannelEvent_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_ChannelForTransmitSet(CAN_MODULE_ID index, CAN_CHANNEL channel, uint8_t channelSize, CAN_TX_RTR rtren, CAN_TXCHANNEL_PRIORITY priority)
{
     CAN_ChannelForTransmitSet_pic32(index, channel, channelSize, rtren, priority);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsChannelForTransmitSet(CAN_MODULE_ID index)
{
     return CAN_ExistsChannelForTransmitSet_pic32(index);
}

PLIB_INLINE_API void PLIB_CAN_PendingTransmissionsAbort(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     CAN_PendingTransmissionsAbort_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPendingTransmissionsAbort(CAN_MODULE_ID index)
{
     return CAN_ExistsPendingTransmissionsAbort_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TransmitChannelFlush(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     CAN_TransmitChannelFlush_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTransmitChannelFlush(CAN_MODULE_ID index)
{
     return CAN_ExistsTransmitChannelFlush_pic32(index);
}

PLIB_INLINE_API CAN_TX_CHANNEL_STATUS PLIB_CAN_TransmitChannelStatusGet(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     return CAN_TransmitChannelStatusGet_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTransmitChannelStatus(CAN_MODULE_ID index)
{
     return CAN_ExistsTransmitChannelStatus_pic32(index);
}

PLIB_INLINE_API CAN_TX_MSG_BUFFER* PLIB_CAN_TransmitBufferGet(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     return CAN_TransmitBufferGet_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTransmitBufferGet(CAN_MODULE_ID index)
{
     return CAN_ExistsTransmitBufferGet_pic32(index);
}

PLIB_INLINE_API bool PLIB_CAN_TransmissionIsAborted(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     return CAN_TransmissionIsAborted_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTransmissionIsAborted(CAN_MODULE_ID index)
{
     return CAN_ExistsTransmissionIsAborted_pic32(index);
}

PLIB_INLINE_API CAN_RX_MSG_BUFFER* PLIB_CAN_ReceivedMessageGet(CAN_MODULE_ID index, CAN_CHANNEL channel)
{
     return CAN_ReceivedMessageGet_pic32(index, channel);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsReceivedMessageGet(CAN_MODULE_ID index)
{
     return CAN_ExistsReceivedMessageGet_pic32(index);
}

PLIB_INLINE_API void PLIB_CAN_ChannelForReceiveSet(CAN_MODULE_ID index, CAN_CHANNEL channel, uint32_t channelSize, CAN_RX_DATA_MODE dataOnly)
{
     CAN_ChannelForReceiveSet_pic32(index, channel, channelSize, dataOnly);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsChannelForReceiveSet(CAN_MODULE_ID index)
{
     return CAN_ExistsChannelForReceiveSet_pic32(index);
}

PLIB_INLINE_API void PLIB_CAN_FilterMaskConfigure(CAN_MODULE_ID index, CAN_FILTER_MASK mask, uint32_t maskBits, CAN_ID_TYPE idType, CAN_FILTER_MASK_TYPE mide)
{
     CAN_FilterMaskConfigure_pic32(index, mask, maskBits, idType, mide);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsFilterMaskConfigure(CAN_MODULE_ID index)
{
     return CAN_ExistsFilterMaskConfigure_pic32(index);
}

